; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v2 ?v6)
             (pred_6 ?v4 ?v3)
             (pred_5 ?v2 ?v3)
             (pred_4 ?v9 ?v2 )
	     (pred_10 ?v2)
             (pred_2 ?v1)
             (pred_12 ?v4)
             (pred_8 ?v3)
             (pred_11 ?v2)
             (pred_9 ?v4)
             (pred_7 ?v2)
             (pred_3 ))



(:action op_5
:parameters (?v8 ?v13 ?v5 ?v10)
:precondition (and (pred_2 ?v8) (pred_2 ?v13) (pred_12 ?v5) (pred_8 ?v10)
          (pred_1 ?v8 ?v13) (pred_6 ?v5 ?v10)
                   (pred_5 ?v13 ?v10) (pred_10 ?v8) 
                   (pred_11 ?v13) (pred_9 ?v5))
:effect (and  (pred_7 ?v13) (not (pred_11 ?v13))))


(:action op_4
:parameters (?v8 ?v11)
:precondition (and (pred_2 ?v8) (pred_2 ?v11)
               (pred_10 ?v8) (pred_1 ?v8 ?v11) (pred_7 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v8))))

(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_2 ?v8) (pred_12 ?v5) 
                  (pred_10 ?v8) (pred_4 ?v5 ?v8) (pred_3 ))
:effect (and (pred_9 ?v5)
   (not (pred_4 ?v5 ?v8)) (not (pred_3 ))))


(:action op_2
:parameters (?v8 ?v7 ?v12)
:precondition (and (pred_2 ?v8) (pred_12 ?v7) (pred_12 ?v12)
                  (pred_10 ?v8) (pred_9 ?v12) (pred_4 ?v7 ?v8))
:effect (and (pred_9 ?v7) (pred_4 ?v12 ?v8)
        (not (pred_9 ?v12)) (not (pred_4 ?v7 ?v8))))

(:action op_1
:parameters (?v8 ?v5)
:precondition (and (pred_2 ?v8) (pred_12 ?v5) 
                  (pred_10 ?v8) (pred_9 ?v5))
:effect (and (pred_3 ) (pred_4 ?v5 ?v8) (not (pred_9 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_01 obj_09 obj_10 obj_11 obj_08 obj_07 obj_04 obj_12
    obj_13 obj_02
    obj_06 obj_05
    )

    (:init
       (pred_3)

       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_07)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_05)

       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_04 obj_11)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_12 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_11)
       (pred_5  obj_09 obj_13)
       (pred_5  obj_11 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_01)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_04)
       (pred_7 obj_12)

       (pred_6  obj_06 obj_13)
       (pred_6  obj_05 obj_02)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_05 obj_08)
       (pred_10 obj_08)
    )

    (:goal (and
       (pred_4 obj_06 obj_03)
    ))
(:constraints
  (always (not (pred_10 obj_11)))
)
)

; plan
1. (op_3 obj_08 obj_05)
   deleted: (pred_4 obj_05 obj_08) (pred_3)
   added: (pred_9 obj_05)
   goals met: 0 of 1
2. (op_5 obj_08 obj_11 obj_05 obj_02)
   deleted: (pred_11 obj_11)
   added: (pred_7 obj_11)
   goals met: 0 of 1
3. (op_1 obj_08 obj_05)
   deleted: (pred_9 obj_05)
   added: (pred_3) (pred_4 obj_05 obj_08)
   goals met: 0 of 1
4. (op_4 obj_08 obj_12)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_4 obj_12 obj_04)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_04)
   goals met: 0 of 1
6. (op_4 obj_04 obj_07)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_10)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_03)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_03)
   goals met: 0 of 1
9. (op_4 obj_03 obj_01)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_01)
   goals met: 0 of 1
10. (op_3 obj_01 obj_06)
   deleted: (pred_4 obj_06 obj_01) (pred_3)
   added: (pred_9 obj_06)
   goals met: 0 of 1
11. (op_4 obj_01 obj_03)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_03)
   goals met: 0 of 1
12. (op_1 obj_03 obj_06)
   deleted: (pred_9 obj_06)
   added: (pred_3) (pred_4 obj_06 obj_03)
   goals met: 1 of 1
